Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: When a window is activated immediately after the activation of some other window, task bar buttons might start flashing on some systems (depending on OS and settings).
ja: 他のウィンドウをアクティブにした直後にウィンドウをアクティブにすると、システムによってはタスクバーのボタンが点滅し始めることがあります（OSや設定によって異なります）。

source: When a window is disabled, the user cannot move it or interact with its controls.
ja: ウィンドウが無効になると、ユーザーはウィンドウを動かしたり、ウィンドウのコントロールを操作したりできなくなります。

source: When a wrapper object with VarType VT_DISPATCH (9) and a null (0) pointer value is assigned a non-null pointer value, its type changes from ComValue to ComObject.
ja: VarTypeVT_DISPATCH（9）でNULL（0）ポインタ値を持つラッパーオブジェクトにNULL以外のポインタ値が割り当てられると、その型はComValueから ComObjectに変化します。

source: When accessing GUI windows via the +LastFound option.
ja: LastFoundオプションでGUIウィンドウにアクセスした場合。

source: When accessing a control or child window via the ahk_id method or as the last-found-window.
ja: ahk_idメソッドでコントロールや子ウィンドウにアクセスする場合、またはlast-found-windowとしてアクセスする場合。

source: When accessing a remote registry (via the KeyName parameter described above), the following notes apply:
ja: リモートレジストリにアクセスする場合（前述のKeyNameパラメータを使用する場合）、以下の注意事項があります：

source: When adding a border to an existing control, it might be necessary to increase the control's width and height by 1 pixel.
ja: 既存のコントロールにボーダーを追加する場合、コントロールの幅と高さを1ピクセルずつ大きくする必要がある場合があります。

source: When adding a large number of items to a control (such as a ListView, TreeView or ListBox), performance can be improved by preventing the control from being redrawn while the changes are being made.
ja: リストビュー、ツリービュー、リストボックスなどのコントロールに多数のアイテムを追加する場合、変更中にコントロールが再描画されるのを防ぐことで、パフォーマンスを向上させることができます。

source: When adding a large number of items, performance can be improved by using TV.Opt("-Redraw") before adding the items and TV.Opt("+Redraw") afterward.
ja: 多数のアイテムを追加する場合、アイテムを追加する前にTV.Opt("-Redraw")を使用し、その後にTV.Opt("+Redraw")を使用することでパフォーマンスを向上させることができる。

source: When allocating a Buffer, take care to calculate the correct number of bytes for whichever encoding is required.
ja: バッファを割り当てる際には、必要なエンコーディングに応じた正しいバイト数を計算するように注意してください。

source: When an AutoHotkey program file (such as AutoHotkey32.exe or AutoHotkey64.exe) is launched without specifying a script file, it no longer searches the user's Documents folder for a default script file.
ja: スクリプトファイルを指定せずにAutoHotkey32.exeやAutoHotkey64.exeなどの実行ファイルを起動しても、ユーザーのドキュメントフォルダーで既定のスクリプトファイルを検索することがなくなりました。

source: When an AutoHotkey v2 Array object is passed to JavaScript, its elements cannot be retrieved with JavaScript's arr[i], because that would attempt to access a property.
ja: AutoHotkey v2のArrayオブジェクトをJavaScriptに渡すと、プロパティにアクセスしようとするため、JavaScriptのarr[i]でその要素を取得することができない。

source: When an Input is terminated this way, EndReason is set to the word EndKey and the EndKey property is set to the name of the key.
ja: この方法でInputを終了させると、EndReasonにEndKeyという単語が設定され、EndKeyプロパティにキーの名前が設定されます。

source: When an array or variable is said to contain an object, what it actually contains is a reference to the object.
ja: 配列や変数がオブジェクトを含んでいると言われるとき、実際に含んでいるのはオブジェクトへの参照します。

source: When an end key is handled by SC, the Input command always produces names for the known secondary SC of any given VK, and always produces scNNN for any other key (even if it has a name).
ja: エンドキーがSCで処理される場合、Inputコマンドは常に任意のVKの既知のセカンダリSCに対して名前を生成し、それ以外のキーに対しては常にscNNNを生成する（たとえ名前を持っていても）。

source: When an inactive window becomes active, the operating system also makes it foremost (brings it to the top of the stack).
ja: 非アクティブなウィンドウがアクティブになると、オペレーティング・システムはそのウィンドウも最前面にする（スタックの一番上に持ってくる）。

source: When an item is selected, the border color of the item changes rather than the item being highlighted (might be non-functional in recent operating systems).
ja: アイテムが選択されると、アイテムがハイライトされるのではなく、アイテムのボーダーカラーが変更されます（最近のオペレーティングシステムでは機能しない場合があります）。

source: When an object is called via IDispatch (the COM interface), any uncaught exceptions which cannot be passed back to the caller will cause an error dialog.
ja: IDispatch（COMインターフェース）を介してオブジェクトが呼び出された場合、呼び出し元に引き渡せない捕捉できない例外は、エラーダイアログを発生させます。

source: When an object is destroyed, __Delete is called.
ja: オブジェクトが破棄されると、__Deleteが呼ばれる。

source: When an uppercase H is used, hexadecimal digits A-F will also be in uppercase.
ja: 大文字のHを使用した場合、16進数のA～Fも大文字になります。

source: When any two items compare equal, the original order of the items is now automatically used as a tie-breaker to ensure more stable results.
ja: また、2つの項目が同数である場合、自動的に元の項目の順番がタイブレーカーとして使用され、より安定した結果が得られるようになりました。

source: When applied as a default option, either S or #SuspendExempt will make the hotstring exempt; that is, to override the directive, S0 must be used explicitly in the hotstring.
ja: デフォルトのオプションとして適用される場合、Sまたは#SuspendExemptのいずれかがホットストリングを免除します。つまり、指令を上書きするには、ホットストリング内でS0を明示的に使用する必要がある。

source: When assigning a value, Key can be any value to associate with Value; in other words, the key used to later access Value.
ja: 値を割り当てる際、Keyには Valueと関連付ける任意の値、言い換えれば、Valueに後からアクセスするためのキーを指定することができる。

source: When assigning a value, the strings "1" and "0" can also be used.
ja: 値を割り当てる場合、文字列"1"、"0"も使用可能です。

source: When assigning or retrieving an array element, the absolute value of the index must be between 1 and the Length of the array, otherwise an exception is thrown.
ja: 配列の要素を代入・取得する場合、インデックスの絶対値が 1 から配列のLengthの間でなければなりません。そうでない場合は例外が発生します。

source: When assigning to a property, the result of the sub-expression is the value being assigned, not a variable reference.
ja: プロパティに代入する場合、部分式の結果は代入される値であり、変数参照ではありません。

source: When buffered events are waiting to start new threads, using Critical "Off" will not result in an immediate interruption of the current thread.
ja: バッファリングされたイベントが新しいスレッドの開始を待っているとき、Critical "Off"を使用しても、現在のスレッドが直ちに中断されることはありません。

source: When building a menu whose contents are not always the same, one approach is to point all such menu items to the same function and have that function refer to its parameters to determine what action to take.
ja: メニューの内容が常に同じとは限らない場合、そのようなメニューはすべて同じ関数を指定し、その関数のパラメータを参照して動作を決定する方法があります。

source: When called from inside a function, only that function's labels are searched.
ja: 関数内部から呼び出された場合、その関数のラベルのみが検索されます。

source: When called, the function evaluates Expression and returns the result.
ja: 呼び出されると、この関数はExpressionを評価し、結果を返します。

source: When calling the function object, it is necessary to supply a value for the normally-hidden this parameter.
ja: 関数オブジェクトを呼び出す際には、通常は隠されているthisパラメータに値を与える必要があります。

source: When compiling a script, variables are evaluated by the compiler and may differ from what the script would return when it is finally executed.
ja: スクリプトをコンパイルする際、変数はコンパイラによって評価され、最終的に実行されたときにスクリプトが返す値とは異なる場合があります。

source: When creating a reference, Value must be the memory address of a variable or buffer with sufficient capacity to store a value of the given type.
ja: 参照を作成する場合、Valueには、指定された型の値を格納するのに十分な容量を持つ変数またはバッファのメモリアドレスが必要です。

source: When creating a structure for use with DllCall, be aware that some fields may need explicit padding added due to data alignment requirements.
ja: DllCallで使用する構造体を作成する場合、データ配列の要件により、フィールドによっては明示的にパディングを追加する必要があることに留意してください。

source: When creating duplicate hotkeys, the order of modifier symbols such as ^!+# does not matter.
ja: 重複するホットキーを作成する場合、^!+#などの修飾記号の順番は関係ありません。

source: When data is written to or read from the file, the file pointer automatically moves to the next byte after that data.
ja: ファイルにデータが書き込まれたり、ファイルから読み出されたりすると、ファイルポインタは自動的にそのデータの次のバイトに移動します。

source: When defining a function, one or more of its parameters can be marked as optional.
ja: 関数を定義する際、1つまたは複数のパラメータをオプションとしてマークすることができます。

source: When defining a function, write an asterisk after the final parameter to mark the function as variadic, allowing it to receive a variable number of parameters:
ja: 関数を定義するとき、最後のパラメータの後にアスタリスクを書くと、その関数は可変パラメータとして扱われ、可変数のパラメータを受け取ることができるようになります：

source: When defining only a getter, the braces and get can be omitted:
ja: ゲッターだけを定義する場合、中括弧とgetは省略できる：

source: When defining your own enumerator, the number of parameters should match the number of variables expected to be passed to the for-loop (before the "in" keyword).
ja: 独自の列挙器を定義する場合、パラメータの数は、forループに渡されると予想される変数の数（「in」キーワードの前）と一致させる必要があります。

source: When each Input is started (by the Start method), it is pushed onto the top of a stack, and is removed from this stack only when the Input is terminated.
ja: Startメソッドで入力が開始されると、スタックの一番上に置かれ、入力が終了したときだけスタックから取り除かれます。

source: When enumerating a SafeArray, Value1 contains the current element and Value2 contains its variant type.
ja: SafeArrayを列挙する場合、Value1には現在の要素が、Value2にはそのバリアントタイプが含まれる。

source: When evaluated, the object is sent a request "give me the value of property Beta", "store this value in property Beta" or "call the method named Beta".
ja: 評価されると、オブジェクトに「プロパティBetaの値を教えて」「この値をプロパティBetaに格納して」「Betaという名前のメソッドを呼び出して」という要求が送られます。

source: When execution hits a breakpoint, use the Debug menu or shortcut keys to step through or resume the script.
ja: 実行中にブレークポイントが発生したら、デバッグメニューやショートカットキーを使って、スクリプトをステップ実行したり再開したりします。

source: When installing under Program Files, the installer creates an additional set of AutoHotkey exe files that can be used to work around some common UAC-related issues.
ja: Program Filesの下にインストールする場合、インストーラは、いくつかの一般的なUAC関連の問題を回避するために使用できるAutoHotkey exeファイルの追加セットを作成します。

source: When it has a suffix not beginning with = (where previously the suffix was ignored).
ja: 接尾辞が=で始まらないとき。従来は接尾辞は無視されていました。

source: When it sees you type a command followed by a comma or space, it displays that command's parameter list to guide you.
ja: コンマやスペースが続くコマンドを入力すると、そのコマンドのパラメータ・リストが表示される。

source: When it's used with the e, E, f, a or A format, the # flag forces the output value to contain a decimal point.
ja: e、E、f、a、Aフォーマットで使用する場合、#フラグは出力値に強制的に小数点を含ませる。

source: When it's used with the g or G format, the # flag forces the output value to contain a decimal point and prevents the truncation of trailing zeros.
ja: gまたはGフォーマットと併用する場合、#フラグは出力値に小数点以下を強制的に含ませ、末尾のゼロの切り捨てを防止します。

source: When it's used with the o, x, or X format, the # flag uses 0, 0x, or 0X, respectively, to prefix any nonzero output value.
ja: o、x、Xフォーマットと併用する場合、#フラグはそれぞれ0、0x、0Xを使用して、0以外の出力値の前に置くようにします。

source: When loading from a multi-icon .ICO file, specifying a width and height also determines which icon to load.
ja: マルチアイコンの.ICOファイルから読み込む場合、幅と高さを指定することで、どのアイコンを読み込むかも決まります。

source: When making repeated calls to a DLL, performance can be dramatically improved by loading it explicitly (this is not necessary for a standard DLL such as User32 because it is always resident).
ja: DLLを繰り返し呼び出す場合、明示的にロードすることでパフォーマンスを飛躍的に向上させることができます（User32などの標準的なDLLは常に常駐しているため必要ありません）。

source: When multiple interpretations are possible, the underlying system functions most likely choose one based on the order defined in the keyboard layout, which is not always the most common or logical choice.
ja: 複数の解釈が可能な場合、基本的なシステム機能はキーボードレイアウトで定義された順序に基づいて1つを選択することがほとんどですが、これは必ずしも最も一般的または論理的な選択とは限りません。

source: When multiple interpreters with the same version number are found, the launcher can rank them according to a predetermined or user-defined set of criteria.
ja: 同じバージョン番号の複数のインタープリターが見つかった場合、ランチャーはあらかじめ設定された、またはユーザーが定義した基準に従って、それらのインタープリターをランク付けすることができます。

source: When omitting this parameter, also omit the comma.
ja: このパラメータを省略する場合は、カンマも省略します。

source: When one of these UIA.exe files is used by an administrator to run a script, the script is able to interact with windows of programs that run as admin, without the script itself running as admin.
ja: これらのUIA.exeファイルの1つを管理者が使用してスクリプトを実行すると、スクリプト自体が管理者として実行されることなく、スクリプトは管理者として実行されるプログラムのウィンドウと対話することができます。

source: When only the first two parameters are present, only the row's attributes and not its text are changed.
ja: 最初の2つのパラメータのみが存在する場合、行の属性のみが変更され、テキストは変更されない。

source: When only this parameter is present, the specified item is selected.
ja: このパラメータだけが存在する場合、指定された項目が選択される。

source: When optional parameters are omitted, any commas at the end of the parameter list must also be omitted to prevent line continuation.
ja: オプションのパラメータが省略された場合、パラメータリストの末尾にあるカンマも、行の継続を防ぐために省略する必要があります。

source: When parameters are passed to Ahk2Exe, a message indicating the success or failure of the compiling process is written to stdout.
ja: Ahk2Exe にパラメータが渡されると、コンパイルの成否を示すメッセージが標準出力に書き出されます。

source: When passing a string to a function, be aware what type of string the function expects.
ja: 関数に文字列を渡すときは、その関数がどの型の文字列を期待しているかを意識してください。

source: When passing large strings to a function, ByRef enhances performance and conserves memory by avoiding the need to make a copy of the string.
ja: 大きな文字列を関数に渡す場合、ByRefを使用すると、文字列のコピーを作成する必要がないため、パフォーマンスが向上し、メモリを節約することができます。

source: When pressing this hotkey, KeyWait waits for the user to physically release the CapsLock key.
ja: このホットキーを押すと、KeyWaitはユーザーが物理的にCapsLockキーを離すのを待ちます。

source: When reading a REG_BINARY key the result is a string of hex characters.
ja: REG_BINARYキーを読み込むと、16進数の文字列が表示されます。

source: When reading a REG_MULTI_SZ key, each of the components ends in a linefeed character (`n).
ja: REG_MULTI_SZキーを読み込む場合、各構成要素は改行文字(`n)で終わります。

source: When referenced from code that came from an embedded resource, A_LineFile contains an asterisk (*) followed by the resource name.
ja: 埋め込まれたリソースから来たコードから参照される場合、A_LineFileにはアスタリスク（*）の後にリソース名が付きます。

source: When referring to a local variable of an outer function inside a nested function.
ja: ネストした関数の内部で、外側関数のローカル変数を参照する場合。

source: When referring to an existing menu item, the name is not case sensitive but any ampersands must be included.
ja: 既存のメニューを参照する場合、名前の大文字と小文字は区別されませんが、アンパサンドは必ず含まれていなければなりません。

source: When referring to an existing menu item, the name is not case-sensitive but any ampersands must be included.
ja: 既存のメニューを参照する場合、名前の大文字と小文字は区別されませんが、アンパサンドは必ず含まれていなければなりません。

source: When removing the caption from a window that will use WinSetTransColor, remove it only after setting the TransColor.
ja: WinSetTransColorを使用するウィンドウからキャプションを削除する場合、TransColorを設定した後に削除してください。

source: When resumed, a thread's settings for things such as SendMode and SetKeyDelay are automatically restored to what they were just prior to its interruption; in other words, a thread will experience no side-effects from having been interrupted (except for a possible change in the active window).
ja: 再開されると、スレッドのSendModeや SetKeyDelayなどの設定は、中断される直前の状態に自動的に復元される。言い換えれば、スレッドは中断されたことによる副作用を経験しない（アクティブ・ウィンドウが変更される可能性を除いて）。

source: When retrieving a value, Key must be a unique value previously associated with another value.
ja: 値を取得する場合、Keyは他の値と以前に関連づけられたユニークな値でなければならない。

source: When running a program via ComSpec (cmd.exe) -- perhaps because you need to redirect the program's input or output -- if the path or name of the executable contains spaces, the entire string should be enclosed in an outer pair of quotes.
ja: ComSpec（cmd.exe）を使ってプログラムを実行する場合（プログラムの入力や出力をリダイレクトする必要があるため）、実行ファイルのパスや名前にスペースが含まれている場合は、その文字列全体を外側の引用符で囲む必要があります。

source: When selecting rows, it is usually best to ensure that at least one row always has the focus property because that allows the Apps key to display its context menu (if any) near the focused row.
ja: 行を選択する場合、少なくとも1つの行が常にフォーカスを持つようにしておくと、Appsキーがフォーカスを持つ行の近くにコンテキストメニューを表示できるようになるからです。

source: When sending a large number of keystrokes, a continuation section can be used to improve readability and maintainability.
ja: 大量のキーを送信する場合、継続部分を使用することで、可読性と保守性を向上させることができます。

source: When sending keys, you generally want to either send a key or key combination for its effect (like Ctrl+C to copy to the clipboard), or type some text.
ja: キーを送信する場合、一般的には、キーまたはキーの組み合わせを送信してその効果を得るか（クリップボードにコピーするCtrl+Cのような）、何らかのテキストを入力することになります。

source: When set to -1, a script's process-priority becomes an important factor in how fast it can send keystrokes.
ja: 1 に設定すると、スクリプトのプロセス優先度がキー入力の送信速度の重要な要素となります。

source: When set to this style, the control creates and sets a state image list with two images using DrawFrameControl.
ja: このスタイルに設定すると、コントロールは、DrawFrameControlを使用して、2つの画像を持つ状態画像リストを作成および設定します。

source: When sharing a script or posting code online, using this directive allows anyone who finds the code to readily identify which version of AutoHotkey it was intended for.
ja: スクリプトを共有したり、コードをオンラインに投稿する場合、このディレクティブを使用すると、コードを見つけた人が、どのバージョンのAutoHotkeyを対象としているかを容易に特定することができます。

source: When specifying an existing hotkey, KeyName is not case sensitive.
ja: 既存のホットキーを指定する場合、KeyNameの大文字と小文字は区別されません。

source: When specifying an existing hotkey, KeyName is not case-sensitive.
ja: 既存のホットキーを指定する場合、KeyNameの大文字と小文字は区別されません。

source: When specifying more than one option using the methods above, spaces optionally may be included between them.
ja: 上記の方法で複数のオプションを指定するときは、オプションの間にスペースを任意に含めることができます。

source: When the "Str" type is used, it means a string in the native format of the current build.
ja: 「Str」型が使用される場合、現在のビルドのネイティブフォーマットの文字列を意味します。

source: When the "U" option is not in effect, an individual quantifier can be made non-greedy by following it with a question mark.
ja: 「U」オプションが有効でない場合、個々の量化詞の後にクエスチョンマークを付けることで、欲張らないようにすることができる。

source: When the OwnDialogs option is not in effect, the Task Modal option (8192) can be used to disable all the script's windows until the user dismisses the message box.
ja: OwnDialogsオプションが有効でない場合、Task Modalオプション（8192）を使用すると、ユーザーがメッセージボックスを解除するまで、スクリプトのすべてのウィンドウを無効にすることができます。

source: When the Send function executes, the first thing it does is release Ctrl and Alt so that the characters get sent properly.
ja: Send関数が実行されると、まずCtrlと Altを解除して、文字が正しく送信されるようにします。

source: When the comment option is absent, semicolon and /*..*/ comments are not supported within the interior of a continuation section because they are seen as literal text.
ja: commentオプションがない場合、セミコロンと/*..*/コメントは、リテラルテキストとみなされるため、継続セクションの内部ではサポートされない。

source: When the RAW option is used, the return value is a Buffer object containing the raw, unmodified contents of the file.
ja: RAWオプションを使用した場合、戻り値は、ファイルの未修正の内容を含むBufferオブジェクトとなる。

source: When the Mode parameter is not "A", the behavior of this function is determined by whether the previous action on GroupName was GroupActivate or GroupDeactivate.
ja: Modeパラメータが「A」でない場合、GroupNameに対する直前のアクションがGroupActivateかGroupDeactivateかによって、この関数の動作が決定されます。

source: When the current thread finishes, the one most recently interrupted will be resumed, and so on, until all the threads finally finish.
ja: 現在のスレッドが終了すると、直近に中断されたスレッドが再開され、最終的にすべてのスレッドが終了するまで、これが繰り返される。

source: When the E and M options are both used, Ctrl+A through Ctrl+Z are supported by including the corresponding ASCII control characters in EndKeys.
ja: EオプションとMオプションの両方を使用する場合、EndKeyに対応するASCII制御文字を含めることで、Ctrl+A から Ctrl+Zをサポートします。

source: When the BoundFunc is called, it calls the function or method to which it is bound, passing a combination of bound parameters and the caller's parameters.
ja: BoundFuncが呼び出されると、バインドされている関数やメソッドが呼び出され、バインドされているパラメータと呼び出し元のパラメータの組み合わせが渡される。

source: When the Help button option (16384) is present in Options, pressing the Help button will have no effect unless both of the following are true:
ja: オプションでヘルプボタンオプション（16384）がある場合、以下の両方が成立していないと、ヘルプボタンを押しても効果がありません：

source: When the ListLines mode is changed, the current line (generally the one that called ListLines or assigned to A_ListLines) is omitted from the line history.
ja: ListLinesモードが変更されると、現在の行（一般にListLinesを呼び出した、またはA_ListLinesに割り当てられた行）が行履歴から省かれる。

source: When the Send finishes, input is re-enabled (unless still blocked by a previous use of BlockInput "On").
ja: 送信終了後、入力は再び有効になります（以前にBlockInput "On"を使用してブロックされていた場合を除く）。

source: When the WM_HELP function is called, it may guide the user by means such as showing another window or message box.
ja: WM_HELP関数が呼び出されると、別のウィンドウやメッセージボックスを表示するなどの手段でユーザーを誘導することができる。

source: When the active window closes, the system typically activates the next most recently active window.
ja: アクティブなウィンドウが閉じると、システムは通常、次に最も新しくアクティブになったウィンドウをアクティブにします。

source: When the callback deems the first parameter to be greater than the second, it should return a positive integer; when it deems the two parameters to be equal, it should return 0, "", or nothing; otherwise, it should return a negative integer.
ja: 2つのパラメータが等しいと判断した場合は、0、""、または何も返さず、そうでない場合は負の整数を返します。

source: When the caller passes three parameters to the function above, Z's default value is ignored.
ja: 呼び出し元が上記の関数に3つのパラメータを渡すと、Zのデフォルト値は無視されます。

source: When the delay is set to -1, a script's process-priority becomes an important factor in how fast it can send keystrokes when using the traditional SendEvent mode.
ja: 遅延を-1に設定すると、従来のSendEventモードを使用する場合、スクリプトのプロセス優先度がキーストロークの送信速度に重要な要素となる。

source: When the dot is omitted, there must be at least one space or tab between the items to be merged.
ja: ドットが省略された場合、マージされる項目の間には少なくとも1つのスペースまたはタブが必要です。

source: When the end key is handled by VK, both physical keys can terminate the Input.
ja: 終了キーがVKで処理される場合、両方の物理キーでInputを終了させることができます。

source: When the following example is executed on a 64-bit system, it shows a 64-bit command prompt even if the script is 32-bit:
ja: 以下の例を64ビットシステムで実行すると、スクリプトが32ビットであっても、64ビットのコマンドプロンプトが表示されます：

source: When the function definition is not explicit, the parameter is named ThisHotkey.
ja: 関数定義が明示されていない場合、パラメータはThisHotkeyと命名されます。

source: When the function executes, the local variable corresponding to that parameter will have no value if the parameter was omitted.
ja: 関数が実行されるとき、パラメータが省略された場合、そのパラメータに対応するローカル変数には値がありません。

source: When the function has completed its purpose, it returns control to the script.
ja: 関数が目的を果たすと、スクリプトに制御を戻す。

source: When the function is assume-global.
ja: 機能がassume-globalの場合。

source: When the function is called (via the returned reference), it evaluates the sub-expression expr and returns the result.
ja: 関数が（返された参照を通じて）呼び出されると、その関数は部分式exprを評価し、結果を返します。

source: When the function name given to DllCall cannot be resolved, AutoHotkey_L automatically appends an "A" (ANSI) or "W" (Unicode) to the function name regardless of which DLL was specified.
ja: DllCallで指定された関数名が解決できない場合、AutoHotkey_Lは、どのDLLが指定されたかにかかわらず、自動的に関数名に「A」（ANSI）または「W」（Unicode）を付加します。

source: When the goal is to load all or a large part of a file into memory, FileRead performs much better than using a file-reading loop.
ja: ファイルの全部または大部分をメモリに読み込むことを目的とする場合、FileReadはファイル読み込みループを使用するよりもはるかに優れた性能を発揮します。

source: When the hotkey fires, its key's native function will not be blocked (hidden from the system).
ja: ホットキーが起動しても、そのキーのネイティブ機能はブロックされない（システムから隠される）。

source: When the icon has been frozen, Pause and Suspend will not change it.
ja: アイコンがフリーズしている場合、一時停止や サスペンドをしてもアイコンは変わりません。

source: When the key, mouse or joystick button combination which forms a hotkey is pressed, the #HotIf expression is evaluated to determine if the hotkey should activate.
ja: ホットキーを構成するキー、マウス、ジョイスティックボタンの組み合わせが押されると、#HotIf式が評価され、ホットキーが起動するかどうかが決定されます。

source: When the last reference to an object is released, the object is freed automatically.
ja: オブジェクトへの最後の参照が解放されると、オブジェクトは自動的に解放される。

source: When the loop breaks or completes, these variables are restored to their former values.
ja: ループが切れたり終了したりすると、これらの変数は元の値に戻されます。

source: When the menu is displayed, such an item can be selected by pressing the corresponding key on the keyboard.
ja: メニューが表示されているときに、キーボードの対応するキーを押すことで、その項目を選択することができます。

source: When the method is called, this refers to an instance of the class.
ja: メソッドが呼ばれると、thisはクラスのインスタンスを参照する。

source: When the method returns, the new value is assigned to the VarRef.
ja: メソッドが戻ると、新しい値が VarRef に代入されます。

source: When the mouse action finishes, input is re-enabled (unless still blocked by a previous use of BlockInput "On").
ja: マウス操作が終了すると、入力は再び有効になります（以前にBlockInput "On"を使用してブロックされている場合を除く）。
